export const keyTranslations: { [key: string]: string } = {
	C: "До",
	"C#": "До-диез",
	D: "Ре",
	Eb: "Ми-бемоль",
	E: "Ми",
	F: "Фа",
	"F#": "Фа-диез",
	G: "Соль",
	Ab: "Ля-бемоль",
	A: "Ля",
	Bb: "Си-бемоль",
	B: "Си",
};

export const suffixTranslations: { [key: string]: string } = {
	major: "мажор",
	minor: "минор",
	dim: "уменьшенный",
	aug: "увеличенный",
	"5": "квинт-аккорд",
	"7": "септ",
	maj7: "большой септаккорд",
	m7: "минорный септаккорд", 
	dim7: "уменьшенный септаккорд",
	aug7: "увеличенный септаккорд",
	m7b5: "полууменьшенный",
	mmaj7: "минорный с большой септимой",
	"7b5": "септаккорд с пониженной квинтой",

	sus: "sus",
	sus2: "sus2",
	sus4: "sus4",
	sus2sus4: "sus2sus4",
	"7sus4": "7sus4",
	maj7sus2: "maj7sus2",

	"6": "секст",
	add9: "add9",
	madd9: "минорный add9",
	add11: "add11",
	m6: "минорный секст",

	"9": "нонаккорд", 
	maj9: "большой нонаккорд",
	m9: "минорный нонаккорд",
	"69": "секст-нонаккорд",
	m69: "минорный секст-нонаккорд",
	aug9: "увеличенный нонаккорд",
	"9b5": "нонаккорд с пониженной квинтой",
	mmaj9: "минорный с большой ноной",
	"7b9": "септ с малой ноной",
	"7#9": "септ с большой ноной", // "Аккорд Хендрикса"

	"11": "ундецим",
	m11: "минорный ундецим",
	maj11: "большой ундецим",
	mmaj11: "минорный с большой ундецимой",
	"9#11": "нон с повышенной ундецимой",

	"13": "терцдецим",
	maj13: "большой терцдецим",

	alt: "альтерированный",
	maj7b5: "большой септ с пониженной квинтой",
	"maj7#5": "большой септ с повышенной квинтой",
	mmaj7b5: "минорный с большой септимой и пониженной квинтой",

	"/C": "с басом До",
	"/C#": "с басом До-диез",
	"/D": "с басом Ре",
	"/D#": "с басом Ре-диез",
	"/Eb": "с басом Ми-бемоль",
	"/E": "с басом Ми",
	"/F": "с басом Фа",
	"/F#": "с басом Фа-диез",
	"/G": "с басом Соль",
	"/G#": "с басом Соль-диез",
	"/Ab": "с басом Ля-бемоль",
	"/A": "с басом Ля",
	"/Bb": "с басом Си-бемоль",
	"/B": "с басом Си",

	"m/A": "минор с басом Ля",
	"m/Ab": "минор с басом Ля-бемоль",
	"m/B": "минор с басом Си",
	"m/Bb": "минор с басом Си-бемоль",
	"m/C": "минор с басом До",
	"m/C#": "минор с басом До-диез",
	"m/D": "минор с басом Ре",
	"m/D#": "минор с басом Ре-диез",
	"m/Eb": "минор с басом Ми-бемоль",
	"m/E": "минор с басом Ми",
	"m/F": "минор с басом Фа",
	"m/F#": "минор с басом Фа-диез",
	"m/G": "минор с басом Соль",
	"m/G#": "минор с басом Соль-диез",

	"7/G": "септ с басом Соль",
	"m9/A": "минорный нон с басом Ля",
	"m9/Ab": "минорный нон с басом Ля-бемоль",
	"m9/B": "минорный нон с басом Си",
	"m9/Bb": "минорный нон с басом Си-бемоль",
	"m9/C": "минорный нон с басом До",
	"m9/C#": "минорный нон с басом До-диез",
	"m9/D": "минорный нон с басом Ре",
	"m9/Eb": "минорный нон с басом Ми-бемоль",
	"m9/E": "минорный нон с басом Ми",
	"m9/F": "минорный нон с басом Фа",
	"m9/F#": "минорный нон с басом Фа-диез",
	"m9/G": "минорный нон с басом Соль",
};

export function translateChordName(key: string, suffix: string): string {
	const simpleSuffix = suffix.split("/")[0]; // Например, "m"

	if (suffixTranslations[suffix]) {
		const translatedKey = keyTranslations[key] || key;
		if (suffix.includes("/")) {
			return `${translatedKey} ${suffixTranslations[suffix]}`;
		}
		return `${translatedKey} ${suffixTranslations[suffix]}`;
	}

	if (suffixTranslations[simpleSuffix]) {
		const translatedKey = keyTranslations[key] || key;
		const translatedSuffix = suffixTranslations[simpleSuffix] || simpleSuffix;
		return `${translatedKey} ${translatedSuffix}`;
	}

	return `${key} ${suffix}`;
}
